#pragma once

#include <Arduino.h>

//==========================================================
// ClockNano
// Biblioteca de Botões
//
// API pública
//==========================================================

//----------------------------------------------------------
// Identificação dos botões
//----------------------------------------------------------

enum class ButtonId : uint8_t
{
    None = 0,

    Minus,
    Ok,
    Plus,
    Home
};

//----------------------------------------------------------
// Eventos gerados
//----------------------------------------------------------

enum class ButtonEventType : uint8_t
{
    None = 0,

    Click,

    LongPress,

    Repeat,

    Release
};

//----------------------------------------------------------
// Evento
//----------------------------------------------------------

struct ButtonEvent
{
    ButtonId button;

    ButtonEventType type;

    uint32_t timestamp;
};

//==========================================================
// API pública
//==========================================================

namespace Buttons
{
    //------------------------------------------------------
    // Inicialização
    //------------------------------------------------------

    bool begin();

    //------------------------------------------------------
    // Atualiza a máquina de estados
    // Deve ser chamada continuamente no loop()
    //------------------------------------------------------

    void update();

    //------------------------------------------------------
    // Retorna TRUE se existir um evento na FIFO
    //------------------------------------------------------

    bool read(ButtonEvent& event);

    //------------------------------------------------------
    // Esvazia completamente a fila de eventos
    //------------------------------------------------------

    void clear();
}