#include "ConfigEEPROM.h"

#include <EEPROM.h>

namespace ConfigEEPROM
{

    //==========================================================
    // Carrega brilho
    //==========================================================

    uint8_t loadBrightness()
    {
        uint8_t value =
            EEPROM.read(ADDR_BRIGHTNESS);

        //------------------------------------------------------
        // Validação
        //------------------------------------------------------

        if (value > 3)
        {
            value = DEFAULT_BRIGHTNESS;
        }

        return value;
    }

    //==========================================================
    // Salva brilho
    //==========================================================

    void saveBrightness(uint8_t value)
    {
        //------------------------------------------------------
        // Segurança
        //------------------------------------------------------

        if (value > 3)
            value = 3;

        //------------------------------------------------------
        // Só grava se mudou
        //------------------------------------------------------

        EEPROM.update(
            ADDR_BRIGHTNESS,
            value);
    }

}